import styled from "styled-components";
import SearchDetailItem from "./SearchDetailItem";

export default function SearchDetail({searchText}) {
    
    // Chat-GPT의 답변입니다
    const list = [
        "가", "나", "사과", "나무", "가","나", "사과", "나무", "바나나", "다",
        "라", "마", "아이스크림", "자바", "자바스크립트","코딩", "개발", "프로그래밍", "컴퓨터", "웹",
        "모바일", "애플", "구글", "페이스북", "인스타그램","트위터", "마이크로소프트", "아마존", "데이터베이스", "네트워크",
        "인터넷", "웹사이트", "브라우저", "서버", "클라이언트","프론트엔드", "백엔드", "디자인", "사용자", "인터페이스",
        "키보드", "마우스", "화면", "프린터", "모니터","노트북", "스마트폰", "태블릿", "게임", "음악","영화", "책", "운동", "요가", "등산",
        "헬스", "요리", "음식", "음료", "커피","차", "물", "과일", "야채", "고기","생선", "계란", "치즈", "빵", "케이크","아이스크림", 
        "초콜릿", "사탕", "햄버거", "피자", "파스타", "스테이크", "샐러드", "라면", "국수","김치", "부대찌개", "떡볶이", 
        "갈비", "삼겹살", "비빔밥", "순대", "백반", "냉면", "짜장면","짬뽕", "탕수육", "마라탕", "샤브샤브", "훠궈",
        "치킨", "피맥", "맥주", "소주", "막걸리","와인", "칵테일", "주스", "스무디", "요구르트",
        "커피", "차", "물", "과일", "야채","고기", "생선", "계란", "치즈", "빵",
        "케이크", "아이스크림", "초콜릿", "사탕", "햄버거","피자", "파스타", "스테이크", "샐러드", "라면",
        "국수", "김치", "부대찌개", "떡볶이", "갈비","삼겹살", "비빔밥", "순대", "백반", "냉면","짜장면", "짬뽕", "탕수육", "마라탕", "샤브샤브",
        "훠궈", "치킨", "피맥", "맥주", "소주","막걸리", "와인", "칵테일", "주스", "스무디",
        "요구르트", "옷", "신발", "가방", "악세사리","시계", "모자", "양말", "속옷", "티셔츠",
        "바지", "원피스", "스커트", "재킷", "코트","신발", "운동화", "구두", "샌들", "부츠",
        "스니커즈", "모자", "캡", "비니", "넥타이","스카프", "귀걸이", "목걸이", "반지", "시계",
        "안경", "헤어밴드", "화장품", "립스틱", "아이섀도우","파운데이션", "마스카라", "네일", "향수", "로션",
        "세럼", "코로나", "감염병", "바이러스", "마스크","격리", "사회적 거리두기", "손씻기", "백신", "의사","간호사", "병원", "진료", "검사", "치료",
        "약", "건강", "운동", "영양", "다이어트","식사", "수면", "스트레스", "의학", "미용","건강", "서적", "소"
      ];
      
    const getListByInputText = (text) => {
        if (text === "") {
            return []
        }
        return list.filter(it => it.includes(text))
    }

    var result = (<></>)
    
    if (getListByInputText(searchText).length > 0) {
        result = (
            <Container>
            <List>
                {getListByInputText(searchText).map(it => <SearchDetailItem item={it}/>)}
            </List>
            </Container>
        )
    }
    return result
}

const Container = styled.div`
    text-align: center;
`

const List = styled.ul`
    position: absolute;
    transform: translate(-50%);
    display: inline-block;
    width: 500px;
    padding: 0;
    border: 1px solid #f1f1f1;
    list-style: none;
    text-align: left;
    border-radius: 10px;
    max-height: 400px;
    overflow-y: scroll;
`